<?php


echo 'Задание 1<br/>';
// С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.

$i = 1;

while ($i <= 100) {
	if ($i % 3 == 0) {
		echo $i.', ';
	};
	$i++;
};



echo '<hr/><br/>Задание 2<br/>';
// С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
// 0 – это ноль.
// 1 – нечетное число.
// 2 – четное число.
// 3 – нечетное число.
// …
// 10 – четное число.


$i = 0;

do {
	if ($i == 0) {
		echo "Это ноль.<br/>";
	}
	elseif ($i % 2 == 0) {
		echo "$i Чётное число.<br/>";
	}
	else {
		echo "$i Нечётное число.<br/>";
	}
}
while (++$i <= 10);


echo '<hr/><br/>Задание 3<br/>';
// 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве 
// значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:
// Московская область:
// Москва, Зеленоград, Клин
// Ленинградская область:
// Санкт-Петербург, Всеволожск, Павловск, Кронштадт
// Рязанская область … (названия городов можно найти на maps.yandex.ru)

$geo = [
	'Московская' => ['Москва', 'Зеленоград', 'Клин'],
	'Ленинградская' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
	'Рязанская' => ['Рязань', 'Рыбное', 'Сасово', 'Касимов', 'Шацк', 'Михайлов'],
];
// var_dump($geo);
echo '<br/>';
// var_dump($geo['Рязанская']);

foreach ($geo as $key => $reg) {
	echo "$key область:<br/>";
	foreach ($reg as $city) {
		echo "$city, ";
	};
	echo '<br/>';
};



echo '<hr/><br/>Задание 4<br/>';
// Объявить массив, индексами которого являются буквы русского языка, 
// а значениями – соответствующие латинские буквосочетания 
// (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
// Написать функцию транслитерации строк.

$text = 'однажды, в студёную зимнюю пору...';

echo translit($text);

function translit($inputstr) {
	$letters = [
		'а' => 'a',
		'б' => 'b',
		'в' => 'v',
		'г' => 'g',
		'д' => 'd',
		'е' => 'e',
		'ё' => 'yo',
		'ж' => 'j',
		'з' => 'z',
		'и' => 'i',
		'й' => '',
		'к' => 'k',
		'л' => 'l',
		'м' => 'm',
		'н' => 'n',
		'о' => 'o',
		'п' => 'p',
		'р' => 'r',
		'с' => 's',
		'т' => 't',
		'у' => 'u',
		'ф' => 'f',
		'х' => 'h',
		'ц' => 'ts',
		'ч' => 'ch',
		'ш' => 'sh',
		'щ' => 'sth',
		'ь' => '',
		'ы' => 'y',
		'ъ' => '`',
		'э' => 'e',
		'ю' => 'yu',
		'я' => 'ya',
		' ' => ' ',
		',' => ',',
		'.' => '.',
		'-' => '-',
	];


	// echo "$text<br/>";
	$splittext = preg_split ('//u', $inputstr);
	// var_dump($splittext);
	// echo $splittext[3];
	$outputstr = '';
	foreach ($splittext as $value) {
		// echo $value;
		$outputstr = $outputstr.$letters[$value];
	};
	return $outputstr;
};

echo '<hr/><br/>Задание 5<br/>';
// 5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.

$text = 'однажды, в студёную зимнюю пору...';

echo spaceto_($text);

function spaceto_($inputstr) {
	$splittext = preg_split ('//u', $inputstr);
	$outputstr = '';
	foreach ($splittext as $value) {
	if ($value == ' ') {$outputstr = $outputstr.'_';}
	else {$outputstr = $outputstr.$value;};
	};
	return $outputstr;
};


echo '<hr/><br/>Задание 6<br/><hr/>';
// 6. В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP. 
// Необходимо представить пункты меню как элементы массива и вывести их циклом. 
// Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.


  $header1 = '&#9749; Онлайн-турбюро "Диван Трэвел"'; 
  $menu = [
    'Главная' => 'index.html',
    'Каталог' => 'catalog.html',
    'Контакты' => 'contacts.html',
  ];

// Реализовать подменю можно через вложенные массивы. В случае, если в ячейке массива лежат данные с типом "массив" - 
  // запускаем функцию формирования списка.

    $menu2 = [
    'Главная' => 'index.html',
    'Каталог' => ['Испания' => 'spain.html', 'Турция' => 'turkye.html', 'Греция' => 'greece.html'],
    'Контакты' => 'contacts.html',
  ];
  // var_dump($menu2);

function menuconstruct($content) {
	$output = '';
	foreach ($content as $itemname => $link) {
  	$output = $output.'<li><a href="'.$link.'">'.$itemname.'</a></li>';
  	};
  	return $output;
};

?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>&#9749; Онлайн-турбюро "Диван Трэвел"</title>
</head>
<body>
   <ul>

<!-- Фрагмент кода PHP для формирования меню -->

<?php
	echo menuconstruct($menu);
?>
          
   </ul>
   <!-- 
   Конец маркированного списка - меню сайта
   Горизонтальная черта
     -->
   <hr>
   <!-- Заголовок -->
   <h1>
<?php 
  echo $header1; 
?>
   </h1>
    <!-- Приветственное сообщение  -->
   <p>
        <b>Диван-Travel</b> - это небольшое онлайн-турбюро, специализирующееся на дистанционных продажах различных туристических услуг. Это как пакетные туры от различных туроператоров России, и так и авиабилеты, отели и страховки. А также мы можем оказать вам консультации по вопросу оформления виз в визовые страны и заграничных паспортов в рамках наших компетенций.<br>
        Наше бюро существует уже два года. За это время туристы с нашей помощью посетили множество стран, в том числе - Грецию, Турцию, Египет, Венгрию, Доминиканскую республику, Испанию, Беларусь, курорты России. Наша команда имеет не только опыт подбора туров для клиентов, но и более чем десятилетний опыт собственных путешествий - как по России, так и за рубежом, как с туроператорами, так и самостоятельно.
    </p>
        В чем наши преимущества перед классическими турагентствами?
        
        <!-- список с преимуществами -->
        
        <ul>
            <li>
                Наш девиз - <b>"Планируйте свой отдых, не вставая с дивана!"</b>. А это значит, что для покупки тура, авиабилетов, брони отеля вам не нужно даже вставать из-за компьютера.
            </li>
            <li>
                <b>Мы все делаем дистанционно</b>: вас никто не будет торопить - можно, не спеша, все взвесить, обдумать варианты прежде чем что-то покупать. Главное - не упустить интересные предложения.
            </li>
            <li>
                <b>Мы экономим ваше время</b>: поиск и подбор тура происходит через интернет. Вы можете просто выбирать из тех предложений, которые мы вам присылаем, вне зависимости от города, в котором вы проживаете.
            </li>
            <li>
                <b>Мы тратим на вас столько времени, сколько нужно</b>, чтобы вы определились с выбором, вне зависимости от времени суток, будней, либо выходных.
            </li>
            <li>
                Мы <b>сотрудничаем с большинством туроператоров</b>, среди которых самые крупные и надежные.
            </li>
            <li>
                Мы предлагаем <b>туры по ценам туроператора</b>, вы оплачиваете услуги напрямую туроператору - никаких дополнительных процентов и доплат.
            </li>
        </ul>
        Если вас заинтересовали наши услуги - отправляйте нам ваши запросы. 
        Мы всегда рады вам помочь
    </p>
    <hr/>
     <!-- Footer -->
    <p>&copy; Все права защищены.</p>
</body>
</html>